[net]
# Testing
batch=1
subdivisions=1
# Training
# batch=64
# subdivisions=2
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

# 0
[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

# 1
[maxpool]
size=2
stride=2

# 2
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

# 3
[maxpool]
size=2
stride=2

# 4
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

# 5
[maxpool]
size=2
stride=2

# 6
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

# 7
[maxpool]
size=2
stride=2

# 8
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 9
[maxpool]
size=2
stride=2

# 10
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 11
[maxpool]
size=2
stride=1

# 12
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

# 13
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

# 14
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

# 15
[convolutional]
size=1
stride=1
pad=1
filters=260
activation=linear



# 16
[yolo]
mask = 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
anchors=35.0,31.0, 181.0,24.0, 88.0,53.0, 62.0,84.0, 139.0,44.0, 123.0,56.0, 47.0,169.0, 115.0,79.0, 187.0,52.0, 158.0,68.0, 91.0,135.0, 244.0,61.0, 183.0,95.0, 316.0,69.0, 153.0,158.0, 272.0,114.0, 124.0,321.0, 492.0,196.5, 51.0,363.0, 277.0,245.0
classes=8
num=20
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

# 17
[route]
layers = -4

# 18
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

# 19
[upsample]
stride=2

# 20
[route]
layers = -1, 8

# 21
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

# 22
[convolutional]
size=1
stride=1
pad=1
filters=260
activation=linear

# 23
[yolo]
mask = 0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
anchors=35.0,31.0, 181.0,24.0, 88.0,53.0, 62.0,84.0, 139.0,44.0, 123.0,56.0, 47.0,169.0, 115.0,79.0, 187.0,52.0, 158.0,68.0, 91.0,135.0, 244.0,61.0, 183.0,95.0, 316.0,69.0, 153.0,158.0, 272.0,114.0, 124.0,321.0, 492.0,196.5, 51.0,363.0, 277.0,245.0
classes=8
num=20
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
